Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: In YAML, keys that begin with `%` are not allowed. However, profile keys must start with this symbol. To resolve this, enclose the profile keys in double quotes, as demonstrated by the example, `"%test"`.
ja_jp: YAML において、 `%` で始まるキーは許されません。 しかし、プロファイルキーはこのシンボルで始めなければなりません。 `"%test"` これを解決するには、プロファイルキーを二重引用符で囲みます。

source: In _experimental_ mode, early feedback is requested to mature the idea. There is no guarantee of stability nor long term presence in the platform until the solution matures. Feedback is welcome on our https://groups.google.com/d/forum/quarkus-dev[mailing list] or as issues in our https://github.com/quarkusio/quarkus/issues[GitHub issue tracker].
ja_jp: _experimental_ モードでは、アイデアを成熟させるために早期のフィードバックが求められます。ソリューションが成熟するまでの間、プラットフォームの安定性や長期的な存在を保証するものではありません。フィードバックは link:https://groups.google.com/d/forum/quarkus-dev[メーリングリスト] や link:https://github.com/quarkusio/quarkus/issues[GitHubの課題管理] で受け付けています。

source: In _preview_, backward compatibility and presence in the ecosystem is not guaranteed. Specific improvements might require changing configuration or APIs, and plans to become _stable_ are under way. Feedback is welcome on our https://groups.google.com/d/forum/quarkus-dev[mailing list] or as issues in our https://github.com/quarkusio/quarkus/issues[GitHub issue tracker].
ja_jp: _preview_ では、下位互換性やエコシステムでの存在は保証されていません。具体的な改善には設定や API の変更が必要になるかもしれませんが、 _stable_ になるための計画は現在進行中です。フィードバックは link:https://groups.google.com/d/forum/quarkus-dev[メーリングリスト] や link:https://github.com/quarkusio/quarkus/issues[GitHub の課題管理] で受け付けています。

source: In _preview_, backward compatibility and presence in the ecosystem is not guaranteed. Specific improvements might require changing configuration or APIs, or even storage formats, and plans to become _stable_ are under way. Feedback is welcome on our https://groups.google.com/d/forum/quarkus-dev[mailing list] or as issues in our https://github.com/quarkusio/quarkus/issues[GitHub issue tracker].
ja_jp: _プレビュー版_ では、後方互換性やエコシステムでの存在は保証されていません。具体的な改善のためには、設定やAPI、あるいはストレージのフォーマットを変更する必要があるかもしれませんが、 _安定化_ に向けた計画は進行中です。ご意見・ご感想は、 link:https://groups.google.com/d/forum/quarkus-dev[メーリングリスト]や link:https://github.com/quarkusio/quarkus/issues[GitHubのイシュートラッカー]でお寄せください。

source: In _tech preview_ mode, early feedback is requested to mature the idea. There is no guarantee of stability in the platform until the solution matures. Feedback is welcome on our https://groups.google.com/d/forum/quarkus-dev[mailing list] or as issues in our https://github.com/quarkusio/quarkus/issues[GitHub issue tracker].
ja_jp: _tech preview_ モードでは、アイデアを成熟させるために早期のフィードバックが求められます。ソリューションが成熟するまでの間、プラットフォームの安定性を保証するものではありません。フィードバックは https://groups.google.com/d/forum/quarkus-dev[mailing list] や https://github.com/quarkusio/quarkus/issues[GitHub issue tracker] で受け付けています。

source: In `application.properties` add:
ja_jp: `application.properties` で以下を追加します。

source: In `application.properties`, specify the dependencies you want to scan for proto files.
ja_jp: `application.properties` で、proto ファイルをスキャンしたい依存関係を指定します。

source: In `embedded.html` or in full-page templates, you will likely want to display information that is available from your extension.
ja_jp: `embedded.html` やフルページのテンプレートでは、エクステンションから得られる情報を表示したい場合が多いでしょう。

source: In a Gradle project, you would find a similar setup:
ja_jp: Gradleプロジェクトでも、同様の設定があります。

source: In a JUnit test, generate a test dataset and send it to the `TimeTableResource` to solve.
ja_jp: JUnit テストでは、テストデータセットを生成し、それを `TimeTableResource` に送信して解決します。

source: In a Quarkus project already configured to use the `quarkus-jdbc-postgresql` extension, you can create a `compose-devservices.yml` file in the root of the project and define a custom service using Compose:
ja_jp: `quarkus-jdbc-postgresql` エクステンションを使用するようにすでに設定されている Quarkus プロジェクトで、プロジェクトのルートに `compose-devservices.yml` ファイルを作成し、Compose を使用してカスタムサービスを定義できます。

source: In a https://quarkus.io/blog/kafka-failure-strategy/[previous blog post], we have looked at failure strategies provided by the Reactive Messaging Kafka connector. But, imagine it's our lucky day, and for once it worked. We should inform Kafka that the processing succeeded. In Kafka terminology, we call this: _offset commit_. This post covers the different strategies to commit offsets with the Reactive Messaging Kafka connector.
ja_jp: link:https://quarkus.io/blog/kafka-failure-strategy/[以前のブログ記事]では、Reactive Messaging Kafkaコネクタが提供する失敗戦略を見てきました。しかし、想像してみてください、それは幸運な日で、一度だけ成功しました。処理が成功したことをKafkaに知らせなければなりません。Kafkaの用語では、これを _オフセットコミット_ と呼びます。この記事では、Reactive Messaging Kafka コネクタを使ったオフセットコミットのさまざまな戦略について説明します。

source: In a local development environment, the cost (think: time) of storing (and retrieving) even bigger cache artifacts is lower than the cost of re-building a Quarkus application. This means, that The Quarkus Gradle plugin allows caching even potentially big artifacts like uber-jars or native binaries in non-CI environments. In CI environments, which run builds against varying states of a code base (think: running CI against every commit on a main branch), adding each built (and big) artifact to the build cache would let the build cache become unnecessarily big, which becomes a problem for example in GitHub, where the total amount of cached artifacts is limited to 10 GB.
ja_jp: ローカル開発環境では、より大きなキャッシュアーティファクトを保存（および取得）するコスト（時間）は、Quarkusアプリケーションを再ビルドするコストよりも低くなります。つまり、Quarkus Gradleプラグインは、非CI環境において、uber-jarやネイティブバイナリのような潜在的に大きな成果物をキャッシュすることができます。コードベースのさまざまな状態に対してビルドを実行するCI環境（メインブランチのすべてのコミットに対してCIを実行することを想定）では、ビルドされた（そして大きな）成果物をビルドキャッシュに追加すると、ビルドキャッシュが不必要に大きくなり、例えば、キャッシュできる成果物の総量が10GBに制限されているGitHubでは問題になります。

source: In a new terminal call the endpoint to see your particle response:
ja_jp: 新しい端末で、エンドポイントを呼び出して、パーティクルの応答を確認します。

source: In a production application, the aforementioned class loading infrastructure is entirely absent - there is a single, purpose built ClassLoader that loads (almost) all classes and dependencies.
ja_jp: 本番アプリケーションでは、前述のクラスローディングのインフラは全く存在しません。目的に応じて構築された単一の ClassLoader があり、(ほぼ) すべてのクラスと依存関係をロードします。

source: In a production environment, do not store plain text passwords. As a result, the `quarkus-security-jpa` defaults to using bcrypt-hashed passwords.
ja_jp: 実稼働環境では、プレーンテキストのパスワードは保存しないでください。 そのため、 `quarkus-security-jpa` はデフォルトで bcrypt でハッシュ化したパスワードを使用します。

source: In a production environment, do not store plain text passwords. As a result, the `security-jpa` defaults to using bcrypt-hashed passwords.
ja_jp: 本番環境では、プレーンテキストのパスワードは保存しないでください。 そのため、 `security-jpa` はデフォルトで bcrypt でハッシュ化したパスワードを使用します。

source: In a reactive route, you can return a `Uni` directly:
ja_jp: Reactive Routesでは、 `Uni` を直接返すことができます。

source: In a real life application, it is obviously something you won't do at startup.
ja_jp: 実際のアプリケーションでは、明らかに起動時に実行しないことです。

source: In a real life application, it is obviously something you won't do on every startup.
ja_jp: 実際のアプリケーションでは、これは明らかに、起動時に毎回行うものではありません。

source: In a separate terminal, run the below command:
ja_jp: 別のターミナルで以下のコマンドを実行します:

source: In a separate terminal, we start the timing application that we are testing, printing the time the application starts
ja_jp: 別のターミナルで、テストしているタイミングアプリケーションを起動し、アプリケーションが起動した時刻表示します

source: In a separated terminal or in the embedded terminal, run:
ja_jp: 別の端末や組込端末で、次を実行します:

source: In a separated terminal or the embedded terminal, go to the project root and run:
ja_jp: 別のターミナルまたは組込ターミナルで、プロジェクトのルートに移動して次を実行します:

source: In a separated terminal, run:
ja_jp: 別のターミナルで、次を実行します:

source: In a similar fashion if the received server multipart request is known and looks something like:
ja_jp: 同様に、受信したサーバーのマルチパート要求が既知で、次のようになる場合、

source: In a similar fashion to Hibernate ORM, Hibernate Reactive supports multiple persistence units.
ja_jp: Hibernate ORM と同様に、Hibernate Reactive は複数の永続化ユニットをサポートしています。

source: In a template, the localized message for an enum constant can be obtained with a message bundle method like `{msg:methodName(enumConstant)}`.
ja_jp: テンプレートでは、列挙定数のローカライズされたメッセージは、`{msg:methodName(enumConstant)}` のようなメッセージバンドルメソッドで取得できます。。

source: In a terminal, launch the application in dev mode using: `./mvnw quarkus:dev`. Quarkus automatically starts a database instance for you and configure the application. Now we only need to implement the HTTP endpoint.
ja_jp: ターミナルで、次のようにしてアプリケーションを開発モードで起動します： `./mvnw quarkus:dev`. Quarkusは自動的にデータベースインスタンスを起動し、アプリケーションの設定を行います。あとは、HTTPエンドポイントを実装するだけです。

source: In a terminal, navigate to the root of the project and run:
ja_jp: ターミナルで、プロジェクトのルートに移動して次を実行します。

source: In a terminal, run `curl -X POST http://localhost:8080/client/multipart`
ja_jp: ターミナルで、 `curl -X POST http://localhost:8080/client/multipart` を実行します。

source: In a test environment, you can also store passwords in plain text by using `@Password(PasswordType.CLEAR)`. For applications running in production, do not store passwords in plain text.
ja_jp: 警告: テスト環境などでは `@Password(PasswordType.CLEAR)` を使ってパスワードをクリアテキストで保存することもできますが、本番では絶対にしないことを強くお勧めします。

source: In addition GitHub discussions supports labelling of discussions the same way as for issues and pull requests. We plan on enabling the QuarkusBot to auto-label discussions in Q&A category to help with additional filtering and targeted notifications.
ja_jp: また、GitHubディスカッションでは、課題やプルリクエストと同じようにディスカッションのラベル付けがサポートされています。QuarkusBotがQ&Aカテゴリにディスカッションを自動でラベル付けすることで、フィルタリングやターゲットを絞った通知ができるようになる予定です。

source: In addition IntelliJ has additional support for Quarkus in their Ultimate non-open source version.
ja_jp: さらにIntelliJは、非オープンソースのUltimate版でQuarkusを追加サポートしています。

source: In addition to Vert.x core, you can use most Vert.x ecosystem libraries. Some Quarkus extension already wraps Vert.x libraries.
ja_jp: Vert.xコアに加えて、ほとんどのVert.xエコシステムライブラリを使用することができます。いくつかのQuarkusエクステンションは、すでにVert.xライブラリをラップしています。

source: In addition to `EntityManager` and `EntityManagerFactory`, Quarkus also supports injecting the following JPA/Hibernate components:
ja_jp: `EntityManager` と `EntityManagerFactory` に加えて、Quarkus は以下の JPA/Hibernate コンポーネントの注入もサポートしています。

source: In addition to `idle-timeout`, reactive datasources can also be configured with a `max-lifetime`. It is the maximum time a connection remains in the pool before it is closed and replaced as needed. The `max-lifetime` allows ensuring the pool has fresh connections with up-to-date configuration.
ja_jp: `idle-timeout` に加えて、リアクティブデータソースは `max-lifetime` を使用して設定することもできます。 これは、接続が切断され、必要に応じて置き換えられるまでに、接続がプール内に留まる最大時間です。 `max-lifetime` を使用すると、プールに最新の設定の新しい接続が確保されます。

source: In addition to delegating all **class** loading to the JDK class loader, this packaging has a few specific characteristics:
ja_jp: すべての **クラス** のローディングを JDK クラスローダーに委譲することに加えて、このパッケージングにはいくつかの特定の特性があります。

source: In addition to dumping configuration values, `track-config-changes` goal also dumps all the Quarkus application dependencies, including Quarkus build time dependencies. This file could be used to check whether Quarkus build classpath has changed since the previous run, for instance together with Develocity's ability to checksum a classpath. By default, the list of dependencies will be stored under `target/quarkus-prod-dependencies.txt` file. A different location could be configured using plugin parameters.
ja_jp: `track-config-changes` ゴールは、設定値だけでなく、Quarkus ビルド時の依存関係を含むすべての Quarkus アプリケーションの依存関係もダンプします。 このファイルは、たとえば Develocity のクラスパスのチェックサム機能と組み合わせて、Quarkus ビルドクラスパスが前回の実行以降に変更されたかどうかを確認するために使用できます。 デフォルトでは、依存関係のリストは `target/quarkus-prod-dependencies.txt` ファイルに保存されます。プラグインパラメーターを使用して別の場所を設定することもできます。

source: In addition to error page support, the Dev Assistant can also help with exceptions via the quarkus log.
ja_jp: エラーページのサポートに加えて、 Dev Assistant は Quarkus ログ経由で例外の解決を支援することもできます。

source: In addition to including the `quarkus-jacoco` extension in your `pom.xml` you will need the following config:
ja_jp: `quarkus-jacoco` エクステンションを `pom.xml` に含めるのに加えて、以下のような設定が必要になります:

source: In addition to including the `quarkus-jacoco` extension in your pom you will need the following config:
ja_jp: `quarkus-jacoco` エクステンションをpomに含めるのに加えて、以下のような設定が必要になります。

source: In addition to individual messages, WebSocket endpoints can handle streams of messages. In this case, the method receives a `Multi<X>` as a parameter. Each instance of `X` is deserialized using the same rules listed above.
ja_jp: WebSocket エンドポイントは、個々のメッセージに加えて、メッセージのストリームも処理できます。 この場合、メソッドは `Multi<X>` をパラメーターとして受け取ります。 `X` の各インスタンスは、上記と同じルールを使用してデシリアライズされます。

source: In addition to making our life easier, it opens up the extension to more contributors.
ja_jp: 私たちの生活が楽になるだけでなく、より多くのコントリビューターにエクステンションを開放することができるのです。

source: In addition to resource permissions, you can define method scopes. A scope typically represents an action performed on a resource. You can create an enforcing Keycloak Authorization Policy with a method scope. For example:
ja_jp: リソース権限に加えて、メソッドスコープを定義できます。 スコープは通常、リソースに対して実行されるアクションを表します。 メソッドスコープを使用して、強制的な Keycloak Authorization Policy を作成できます。 以下に例を示します。

source: In addition to simply being fun, some other requirements were essential as well:
ja_jp: ただ面白いだけではなく、いくつかの条件が必要でした:

source: In addition to the Server side, Quarkus REST comes with a new MicroProfile REST Client implementation that is non-blocking at its core.
ja_jp: Quarkus RESTには、サーバー側だけでなく、新しいMicroProfile RESTクライアントの実装も含まれています。

source: In addition to the Server side, RESTEasy Reactive comes with a new MicroProfile REST Client implementation that is non-blocking at its core.
ja_jp: RESTEasy Reactiveには、サーバー側に加えて、ノンブロッキングを核とした新しいMicroProfile Rest Clientの実装が搭載されています。

source: In addition to the Server side, RESTEasy Reactive comes with a new MicroProfile Rest Client implementation that is non-blocking at its core.
ja_jp: RESTEasy Reactiveには、サーバー側に加えて、ノンブロッキングを核とした新しいMicroProfile Rest Clientの実装が搭載されています。

source: In addition to the `BeanContainer` methods, the following methods are supported: `getInjectableReference()`, `resolveDecorators()`
ja_jp: `BeanContainer` メソッドに加えて、 `getInjectableReference()`、 `resolveDecorators()` のメソッドがサポートされています。

source: In addition to the `pom.xml` `create-extension` also generated the `org.acme.greeting.extension.deployment.GreetingExtensionProcessor` class.
ja_jp: `pom.xml` `create-extension` に加えて `org.acme.quarkus.greeting.deployment.GreetingProcessor` クラスも生成されました。

source: In addition to the `quarkus.proxy` settings, REST Client can obtain proxy credentials from the Quarkus Credentials Provider. See link:https://quarkus.io/guides/credentials-provider[Credentials Provider] for more details.
ja_jp: `quarkus.proxy` 設定に加えて、REST Client は Quarkus Credentials Provider からプロキシーのクレデンシャルを取得できます。詳細は link:https://quarkus.io/guides/credentials-provider[Credentials Provider] を参照してください。

source: In addition to the configuration properties listed in the <<form-configuration-properties>> section, Quarkus supports a programmatic set up during the runtime as in the example below:
ja_jp: <<form-configuration-properties>> セクションに記載されている設定プロパティーに加えて、Quarkus は以下の例のように実行時にプログラムによる設定をサポートします。

source: In addition to the generic container image options, the `container-image-buildpack` also provides the following options:
ja_jp: 一般的なコンテナーイメージのオプションに加えて、`container-image-buildpack` は以下のオプションも提供します。

source: In addition to the generic container image options, the `container-image-docker` also provides the following options:
ja_jp: 一般的なコンテナーイメージのオプションに加えて、 `container-image-docker` では以下のオプションも用意されています。

source: In addition to the generic container image options, the `container-image-jib` also provides the following options:
ja_jp: 一般的なコンテナーイメージのオプションに加えて、 `container-image-jib` では以下のオプションも用意されています。

source: In addition to the generic container image options, the `container-image-openshift` also provides the following options:
ja_jp: 一般的なコンテナ・イメージ・オプションに加えて、 `container-image-openshift` は以下のオプションも用意されています。

source: In addition to the generic container image options, the `container-image-podman` also provides the following options:
ja_jp: 一般的なコンテナ・イメージ・オプションに加えて、 `container-image-podman` には以下のオプションもあります：

source: In addition to the generic container image options, the `container-image-s2i` also provides the following options:
ja_jp: 一般的なコンテナーイメージのオプションに加えて、 `container-image-s2i` では以下のオプションも用意されています。

source: In addition to the high-level API, you can use the Vertx Redis clients directly in your code. The documentation of the Vert.x Redis Client is available on the https://vertx.io/docs/vertx-redis-client/java/[Vert.x Web Site].
ja_jp: 高レベルの API に加えて、Vertx Redis クライアントをコードで直接使用することができます。Vert.x Redis クライアントのドキュメントは https://vertx.io/docs/vertx-redis-client/java/[Vert.x Web サイト] で公開されています。

source: In addition to the method parameters that can be annotated with the appropriate Spring Web annotations from the previous table, `jakarta.servlet.http.HttpServletRequest` and `jakarta.servlet.http.HttpServletResponse` are also supported. For this to function however, users need to add the `quarkus-undertow` dependency.
ja_jp: 前の表にある適切なSpring Webアノテーションでアノテーションできるメソッドパラメータに加えて、 `jakarta.servlet.http.HttpServletRequest` と `jakarta.servlet.http.HttpServletResponse` もサポートされています。ただし、これを機能させるためには、 `quarkus-undertow` の依存関係を追加する必要があります。

source: In addition to the method parameters that can be annotated with the appropriate Spring Web annotations from the previous table, `javax.servlet.http.HttpServletRequest` and `javax.servlet.http.HttpServletResponse` are also supported. For this to function however, users need to add the `quarkus-undertow` dependency.
ja_jp: 前述の表の適切なSpring Webアノテーションでアノテーションできるメソッドパラメータに加えて、 `javax.servlet.http.HttpServletRequest` と `javax.servlet.http.HttpServletResponse` もサポートされています。ただし、これを機能させるためには、 `quarkus-undertow` の依存関係を追加する必要があります。

source: In addition to the new Qute support, we've enhanced existing features around MicroProfile 2.0 and Quarkus 2.x new features.
ja_jp: 新しいQuteのサポートに加えて、MicroProfile 2.0とQuarkus 2.xの新機能を中心に既存の機能を改善しました。

source: In addition to the regular files, the build also produces `target/getting-started-1.0.0-SNAPSHOT-runner`. You can run it using: `./target/getting-started-1.0.0-SNAPSHOT-runner`.
ja_jp: 通常のファイルに加えて、このビルドでは `target/getting-started-1.0.0-SNAPSHOT-runner` を生成します。これを実行するには、次のようにします: `./target/getting-started-1.0.0-SNAPSHOT-runner` .

source: In addition to these package managers, the Quarkus CLI is also installable via https://www.jbang.dev[JBang]. Choose the alternative that is the most practical for you:
ja_jp: これらのパッケージマネージャーに加えて、Quarkus CLI は https://www.jbang.dev[JBang] からもインストールできます。最も実用的な方法を選択してください。

source: In addition to this default configuration, you can configure the name of the `Map` producer using the `kafka-configuration` attribute:
ja_jp: このデフォルト設定に加えて、 `kafka-configuration` 属性を使用して `Map` プロデューサーの名前を設定することができます。

source: In addition to this you can also create your own test stereotypes. For example we could create a `@TransactionalQuarkusTest` as follows:
ja_jp: これに加えて、独自のテスト・ステレオタイプを作成することもできます。例えば、次のように `@TransactionalQuarkusTest` を作成することができます。

source: In addition to this you can also create your own test stereotypes. For example, we could create a `@TransactionalQuarkusTest` as follows:
ja_jp: これに加えて、独自のテストステレオタイプを作成することもできます。例えば、以下のように `@TransactionalQuarkusTest` を作成することができます。

source: In addition to this, the https://principles.reactive.foundation/[Reactive Principles white paper] lists a set of rules and patterns to help the construction of reactive systems.
ja_jp: これに加えて、 link:https://principles.reactive.foundation/[リアクティブ原則ホワイトペーパー]には、リアクティブシステムの構築に役立つ一連のルールとパターンが記載されています。

source: In addition to those Pulsar-provided schemas, Quarkus provides following schema implementations _without enforcing validation_ :
ja_jp: Pulsar が提供するこれらのスキーマに加えて、Quarkus は _検証を適用することなく_ 次のスキーマ実装を提供します。

source: In addition to those goals, there was a constraint related to the fact that applications may be deployed by tenant (i.e. they are not multi-tenant, for different reasons, some being regulatory related). Depending on the application, there may be a few dozens tenants, which would translate into deploying the application once per tenant (so if we had 10 tenants for an application, there would be 10 processes running in production). However, if processes needed to be physically separated, often some portions of configuration could be shared between some tenants, and/or IT environments, and/or geographical zones according to different business rules. Highly simplified and factorized bits of configuration would be a true source of simplicity for the development team, and a true source of complexity for the deployment process.
ja_jp: これらの目標に加えて、アプリケーションがテナントごとにデプロイされるという事実に関連した制約がありました（つまり、規制に関連した理由もありますが、マルチテナントではありません）。アプリケーションによっては、数十のテナントが存在する可能性があり、その場合、テナントごとにアプリケーションを1回デプロイすることになります（つまり、あるアプリケーションに10のテナントがあった場合、本番では10のプロセスが実行されることになります）。しかし、物理的にプロセスを分離する必要がある場合は、異なるビジネスルールに基づいて、一部のテナント、IT環境、地理的ゾーンの間で、設定の一部を共有することができます。高度に単純化、因数分解された構成部分は、開発チームにとっては真の意味での単純さの源となり、デプロイメントプロセスにとっては真の意味での複雑さの源となります。

source: In addition, IntelliJ IDEA has additional support for Quarkus in their Ultimate non-open source version.
ja_jp: さらにIntelliJ IDEA は、非オープンソースのUltimate版でQuarkusを追加サポートしています。

source: In addition, Quarkus also provides the following ways to initialize a new extension project with a Codestart:
ja_jp: さらに、Quarkusには、コードスタートで新しいエクステンションプロジェクトを初期化する次のような方法も用意されています。

source: In addition, Quarkus excels in its ability to interact with a broad range of protocols and communication styles. Whether your application needs to connect to legacy systems, microservices, or emerging cloud technologies, Quarkus facilitates smooth integration and interaction, enhancing the overall adaptability of your solutions. Its support for event-driven architectures, RESTful APIs, gRPC, and other modern protocols ensures that Quarkus-powered applications are well-equipped to thrive in distributed and dynamic environments.
ja_jp: 加えて、Quarkus は、幅広いプロトコルや通信スタイルとやり取りする能力に優れています。アプリケーションがレガシー システム、マイクロサービス、または新興のクラウド テクノロジーに接続する必要がある場合でも、Quarkus はスムーズな統合とやり取りを促進し、ソリューションの全体的な適応性を高めます。イベント駆動型アーキテクチャー、RESTful API、gRPC、およびその他の最新プロトコルをサポートしているため、Quarkus を搭載したアプリケーションは、分散型およびダイナミックな環境で十分に機能するようになります。

source: In addition, custom converters may be registered by adding their fully qualified class name in file `META-INF/services/org.eclipse.microprofile.config.spi.Converter`.
ja_jp: さらに、カスタムコンバーターは `META-INF/services/org.eclipse.microprofile.config.spi.Converter` ファイルに完全修飾クラス名を追加することで登録できます。

source: In addition, if the application is running on a JVM that does not support virtual threads (prior to Java 21), the binder is automatically disabled.
ja_jp: さらに、アプリケーションが仮想スレッドをサポートしていない JVM (Java 21 より前) 上で実行されている場合、バインダーは自動的に無効化されます。

source: In addition, remember to enable the AWS X-Ray tracing parameter in `manage.sh`, in the `cmd_create()` function. This can also be set in the AWS Management Console.
ja_jp: さらに、 `manage.sh` の `cmd_create()` 関数で AWS X-Ray tracing パラメーターを有効にすることを忘れないでください。これはAWSマネジメントコンソールでも設定できます。

source: In addition, the following levels may be configured for applications and libraries using link:https://docs.oracle.com/javase/8/docs/api/java/util/logging/Level.html[`java.util.logging`]:
ja_jp: 加えて、 link:https://docs.oracle.com/javase/8/docs/api/java/util/logging/Level.html[`java.util.logging`] を利用して、アプリケーションとライブラリに対して以下のレベルを設定することができます。

source: In addition, the following return types are also supported:
ja_jp: さらに、次の戻り値の型もサポートされています。

source: In addition, the whole Vert.x API can be used with Quarkus. To provide a cohesive experience, the Vert.x API is also available using a Mutiny variant, i.e., returns Uni and Multi.
ja_jp: さらに、Vert.x API全体をQuarkusで使用することができます。まとまりのある体験を提供するために、Vert.x APIはMutinyのバリアントを使用して、つまりUniとMultiを返すこともできます。
